## prctice pandas

In [76]:
import numpy as np
import pandas as pd

In [77]:
from numpy.random import randn

In [10]:
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'],['W','X', 'Y', 'Z'])

In [23]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [30]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  7.327036
B  0.651118 -0.319318 -0.848077  0.605965  0.423955
C -2.018168  0.740122  0.528813 -0.589001  4.073003
D  0.188695 -0.758872 -0.933237  0.955057  0.035606
E  0.190794  1.978757  2.605967  0.683509  0.036402

In [31]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [32]:
### creating a new column

In [33]:
df['new'] = df['W']**2

In [34]:
#droping rows "E" and "A"
df.drop([n for n in df.index if n == 'E' or n == "A"])

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965  0.423955
C -2.018168  0.740122  0.528813 -0.589001  4.073003
D  0.188695 -0.758872 -0.933237  0.955057  0.035606

In [37]:
#drop column
df.drop("new", axis =1, inplace = True)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df.shape #

(5, 4)

In [40]:
#selcting rows
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [41]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
df.loc['A','W']

2.706849839399938

In [43]:
df.loc[['A','B'],['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [46]:
result = df[df['Y']>0]

In [47]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[df['Y'] > 0][['Z','X']]

          Z         X
A  0.503826  0.628133
C -0.589001  0.740122
E  0.683509  1.978757

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Returning a subset of rows based different conditins on different columns
### Using & and | operatons for and and or

In [52]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [58]:
newind = 'a b c d e'.split()

In [59]:
df['lower_case'] = newind

In [60]:
df

          W         X         Y         Z lower_case
A  2.706850  0.628133  0.907969  0.503826          a
B  0.651118 -0.319318 -0.848077  0.605965          b
C -2.018168  0.740122  0.528813 -0.589001          c
D  0.188695 -0.758872 -0.933237  0.955057          d
E  0.190794  1.978757  2.605967  0.683509          e

In [61]:
df.set_index('lower_case')

                   W         X         Y         Z
lower_case
a           2.706850  0.628133  0.907969  0.503826
b           0.651118 -0.319318 -0.848077  0.605965
c          -2.018168  0.740122  0.528813 -0.589001
d           0.188695 -0.758872 -0.933237  0.955057
e           0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z lower_case
A  2.706850  0.628133  0.907969  0.503826          a
B  0.651118 -0.319318 -0.848077  0.605965          b
C -2.018168  0.740122  0.528813 -0.589001          c
D  0.188695 -0.758872 -0.933237  0.955057          d
E  0.190794  1.978757  2.605967  0.683509          e

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [84]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [85]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [86]:
inside

[1, 2, 3, 1, 2, 3]

In [87]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [88]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [93]:
df.loc['G2'].loc[2]['B'] =34

In [90]:
df.index.names = ['Groups', 'Num']

In [94]:
df

                   A          B
Groups Num
G1     1    1.025984  -0.156598
       2   -0.031579   0.649826
       3    2.154846  -0.610259
G2     1   -0.755325  -0.346419
       2    0.147027  34.000000
       3    0.558769   1.024810

In [96]:
df.xs(1, level='Num')

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419

In [98]:
d = {'A': [1,2,np.nan],'B': [5,np.nan,np.nan],'C': [1,2,3]}

In [99]:
df1 = pd.DataFrame(d)

In [100]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [103]:
df1.dropna(axis =1 )

   C
0  1
1  2
2  3

In [105]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [107]:
df1.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [109]:
df1['A'].fillna(value=df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [110]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [111]:
df2 = pd.DataFrame(data)

In [112]:
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [114]:
bycom = df2.groupby('Company')

In [115]:
bycom.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [117]:
bycom.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [123]:
df2.groupby('Company')['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [129]:
df2.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [132]:
df2.groupby('Company').describe().loc[['FB','GOOG']]

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0